# Pandas and Data Science

`pandas` is a package that grants one access to a range of powerful data analysis tools. This, along with packages such as `numpy` are ubiquitous, and you will find yourself importing these two packages almost every time you start a data science project. 


The value of Pandas comes from the fact that it allows us to define fundamental data structures that are: 

* Flexible and intuitive
* Suitable for many economic settings (The name Pandas comes from 'Panel Data')

In laymans terms, we can think of this package as giving us access to 'excel-like' data structrures that preserve the stucture of .csv and .xlsx files.

In [10]:
# importing the package -- it is standard convention to import pandas as pd

import pandas as pd
import numpy as np
%matplotlib inline

In [11]:
df = pd.read_csv("https://raw.githubusercontent.com/varunsatish/Coding-Tutorials/master/Data/titanic.csv")

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,A54,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,NaN,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,B28,Southampton
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,NaN,1,0,113803,53.100,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.050,C19,S

**Do you notice anything wrong with the data?**

## About the Data...

Before we start any sort of analysis, it is first useful to have a look at the data and if possible read it's documentation. Generally, datasets that you find will come along with some form of documentation describing how the dtaa was collected, what the variables are (and **importantly** how they were coded) and so forth. 

This dataset is made up of individuals who were on board the 'Titanic', an oceanliner which after hitting an iceberg, famously sunk in the Atlantic Ocean in 1912. 

![Titanic](https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/St%C3%B6wer_Titanic.jpg/350px-St%C3%B6wer_Titanic.jpg) 



This dataset is a really popular beginner dataset on [Kaggle]. Kaggle is an online data science community that runs competitions, tutorials and projects utilising tools such as statistics and machine learning. If you have found these workshops interesting and would like to use some of the skills you have learnt, check it out !

[Kaggle]: (https://www.kaggle.com/)

![Titanic documentation](https://github.com/varunsatish/Coding-Tutorials/blob/master/images/titanic_doc.jpg?raw=true) 


**Note**: We have modifed the datset from the original just so that it fits into our tutorial a little easier.

## Data Cleaning

![8020](https://raw.githubusercontent.com/varunsatish/Coding-Tutorials/master/images/80-20_datascience.png)

![meagher](https://raw.githubusercontent.com/varunsatish/Coding-Tutorials/master/images/meagher_tweet.png)

## Dealing with missing values

**Important Note**: There are very important statistical implications of dealing with missing values. In practice you really need to be careful about this, this tutorial is simply demonstrating how you can deal with missing values from a programming perspective **not** a statistical one.

Missing values plague almost every dataset, we can choose to deal with them in different ways. Observations which have been specfied as `NaN` (standing for 'not a number') are examples of undefined or unrepresentable values. They can be produced either because there is no observation, or because of some problematic mathematical operation (for example division by `0`). 

Sometimes it may be appropriate to just fill these values with 0, other times it may be more appripriate to fill these values with some form of imputation (meaning, some sort of calculated value). The `numpy` package is really useful for these sorts of applications. 

As we can see, the `Age` category contains some missing values. It doesn't really make sense to fill in these missing values with a 0, instead we may want to fill in these values with the average. There are many ways we can do this, however the `numpy` method is extremely quick and elegant.

In [12]:
import numpy as np

"""
Strictly speaking we should divide by length of values that are not NaN.
This is purely illustrative, not necessarily statistically accurate
"""

ave_age = df['Age'].sum()/len(df['Age'])  # .sum() sums down column of a dataframe


df['Age'] = df['Age'].fillna(ave_age)  # Filling all NaN values with average age

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.250,A54,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,NaN,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.925,B28,Southampton
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,23.760011,1,0,113803,53.100,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.050,C19,S

Now, notice the 3rd observation. Does it make any sense to speak about ages as a fraction? Maybe, depending on your analysis, but in general no. So what can we do? We can utilise the `int()` function which turns float values into integers.

In [11]:
df['Age'] = [int(age) for age in df['Age']]  # For every age in the column, turn it into an integer

# An alternative method:

df['Age'].astype(int)  # Produces the same output. The code above is a generalised form.

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.250,A54,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,NaN,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.925,B28,Southampton
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,23,1,0,113803,53.100,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.050,C19,S

## Working with Words

Sometimes we have data that has errors relating to the way that words (more generally 'strings') are presented. For example, maybe the dataset displays `University` as `University of Sydney` for some observations but `USYD` for others. This is a problem, because if we want to work with data we need some level of consistency across observations.

So how can we deal with problems such as this? 

The first place to start is to have a look at your data and check for any 'irregularities'. In our dataset, we may notice that for some observations, we observe `Southampton` but `S` for others. We know that these two should be consistent (because of the documentation). Now, we want to make every observation that embarked at `Southampton` to be coded with `S`.

In [13]:
new_string = 'S'
old_string = 'Southampton'

df['Embarked'] = df['Embarked'].replace(old_string, new_string)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.250,A54,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,NaN,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.925,B28,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,23.760011,1,0,113803,53.100,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.050,C19,S

## Prefixes and Suffixes 

One issue that commonly arises when using financial or historical data comes from suffixes and prefixes. Sometimes, when we download data, there are annoying letter or numbers attached to the start or the ends of our observations. For example, suppose we are intersted in the `Cabin` variable. Lets suppose we want to do some calculations on this variable, maybe using `numpy`. Do you see any problems?

I will show you two ways of dealing with this problem, the first using anonymous 'lambda functions' and the second using list comprehension.

### Anonymous Functions

In [19]:
# using an anonymous function to get rid of the letter prefixes on the 'Cabin' variable

prefixer = lambda x: x[1:]

What does this function do? Let's see a concrete example:

In [15]:
letters = 'abcd'

letters[1:]

'bcd'

In [29]:
# making sure everything is a string

df['Cabin'] = [str(x) for x in df['Cabin']]
df['Cabin'].apply(lambda x: x[1:])

0              54
1              85
2              28
3             123
4              19
5              an
6              46
7              an
8              an
9              an
10              6
11            103
12             an
13             an
14             an
15             an
16             an
17             an
18             an
19             an
20             an
21             56
22             an
23              6
24             an
25             an
26             an
27     23 C25 C27
28             an
29             an
          ...
861            an
862            17
863            an
864            an
865            an
866            an
867            24
868            an
869            an
870            an
871            35
872    51 B53 B55
873            an
874            an
875            an
876            an
877            an
878            an
879            50
880            an
881            an
882            an
883            an
884            an
885            an
886            an
887            42
888            an
889           148
890            an
Name: Cabin, Length: 891, dtype: object

We can also do this more directly with list comprehension

In [30]:
[x[1:] for x in df['Cabin']]

['54',
 '85',
 '28',
 '123',
 '19',
 'an',
 '46',
 'an',
 'an',
 'an',
 '6',
 '103',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '56',
 'an',
 '6',
 'an',
 'an',
 'an',
 '23 C25 C27',
 'an',
 'an',
 'an',
 '78',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '33',
 'an',
 '30',
 '52',
 'an',
 'an',
 'an',
 'an',
 'an',
 '28',
 '83',
 'an',
 'an',
 'an',
 '33',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 ' G73',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '23 C25 C27',
 'an',
 'an',
 'an',
 '31',
 'an',
 'an',
 'an',
 '5',
 '10 D12',
 'an',
 'an',
 'an',
 'an',
 '26',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '110',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '58 B60',
 'an',
 'an',
 'an',
 'an',
 '101',
 '26',
 'an',
 'an',
 'an',
 ' E69',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '47',
 '123',
 'an',
 '86',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '2',
 'an',
 'an',
 '2',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '33',
 'an',
 'an',
 'an',
 '19',
 'an',
 'an',
 'an',
 '7',
 'an',
 'an',
 '49',
 'an',
 'an',
 'an',
 'an',
 'an',
 '4',
 'an',
 '32',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '2',
 '4',
 '80',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '6',
 'an',
 'an',
 'an',
 '31',
 'an',
 'an',
 'an',
 'an',
 'an',
 '36',
 'an',
 'an',
 '15',
 'an',
 'an',
 'an',
 'an',
 'an',
 '93',
 'an',
 'an',
 'an',
 'an',
 'an',
 '83',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '78',
 'an',
 'an',
 '35',
 'an',
 'an',
 '6',
 '87',
 'an',
 'an',
 'an',
 'an',
 '77',
 'an',
 'an',
 'an',
 'an',
 '67',
 '94',
 'an',
 'an',
 'an',
 'an',
 '125',
 '99',
 'an',
 'an',
 'an',
 '118',
 'an',
 '7',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '19',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '49',
 '',
 'an',
 'an',
 'an',
 'an',
 '22 C26',
 '106',
 '58 B60',
 'an',
 'an',
 'an',
 '101',
 'an',
 '22 C26',
 'an',
 '65',
 'an',
 '36',
 '54',
 '57 B59 B63 B66',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '7',
 '34',
 'an',
 'an',
 'an',
 'an',
 'an',
 '32',
 'an',
 '',
 'an',
 '18',
 'an',
 '124',
 '91',
 'an',
 'an',
 'an',
 '2',
 '40',
 'an',
 '',
 '2',
 '23 C25 C27',
 'an',
 'an',
 'an',
 '33',
 'an',
 'an',
 'an',
 'an',
 'an',
 '128',
 'an',
 'an',
 'an',
 'an',
 '33',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '37',
 'an',
 'an',
 '35',
 '50',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '82',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '96 B98',
 'an',
 'an',
 '36',
 '6',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '78',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '10',
 '52',
 'an',
 'an',
 'an',
 '44',
 '96 B98',
 'an',
 'an',
 '23 C25 C27',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '34',
 'an',
 'an',
 'an',
 '104',
 'an',
 'an',
 '111',
 '92',
 'an',
 'an',
 '38',
 '21',
 'an',
 'an',
 '12',
 'an',
 '63',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '',
 'an',
 '14',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '49',
 'an',
 '93',
 '37',
 'an',
 'an',
 'an',
 'an',
 '30',
 'an',
 'an',
 'an',
 '20',
 'an',
 '22 C26',
 'an',
 'an',
 'an',
 'an',
 'an',
 '79',
 '65',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '25',
 'an',
 'an',
 '46',
 '33',
 'an',
 'an',
 'an',
 '73',
 'an',
 'an',
 '18',
 'an',
 'an',
 'an',
 '95',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '38',
 'an',
 'an',
 '39',
 '22',
 'an',
 'an',
 'an',
 '86',
 'an',
 'an',
 'an',
 'an',
 'an',
 '70',
 'an',
 'an',
 'an',
 'an',
 'an',
 '16',
 'an',
 '67',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '101',
 '25',
 'an',
 'an',
 'an',
 'an',
 '44',
 'an',
 'an',
 'an',
 '68',
 'an',
 '10',
 'an',
 '68',
 'an',
 '41',
 'an',
 'an',
 'an',
 '20',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '20',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '125',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '4',
 'an',
 'an',
 '19',
 'an',
 'an',
 'an',
 '50',
 'an',
 '9',
 'an',
 'an',
 '23',
 'an',
 '50',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '35',
 'an',
 'an',
 'an',
 '33',
 'an',
 '26',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '48',
 'an',
 'an',
 '58',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '126',
 'an',
 '71',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '51 B53 B55',
 'an',
 '49',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '5',
 '20',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '68',
 ' G63',
 '62 C64',
 '24',
 'an',
 'an',
 'an',
 'an',
 'an',
 '24',
 'an',
 'an',
 '90',
 '124',
 '126',
 'an',
 'an',
 ' G73',
 '45',
 '101',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '8',
 'an',
 'an',
 'an',
 'an',
 'an',
 '5',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '101',
 'an',
 'an',
 '45',
 '46',
 '57 B59 B63 B66',
 'an',
 'an',
 '22',
 'an',
 'an',
 '30',
 'an',
 'an',
 '121',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '77',
 'an',
 'an',
 'an',
 '96 B98',
 'an',
 '11',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '77',
 'an',
 'an',
 'an',
 '38',
 'an',
 'an',
 '3',
 'an',
 '20',
 '6',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '82 B84',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '17',
 'an',
 'an',
 'an',
 'an',
 'an',
 '96 B98',
 'an',
 'an',
 'an',
 '36',
 'an',
 'an',
 '8',
 'an',
 'an',
 'an',
 'an',
 'an',
 '102',
 'an',
 'an',
 'an',
 'an',
 '69',
 'an',
 'an',
 '121',
 'an',
 'an',
 'an',
 'an',
 'an',
 '28',
 'an',
 'an',
 'an',
 'an',
 'an',
 '49',
 'an',
 'an',
 'an',
 '47',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '92',
 'an',
 'an',
 'an',
 '28',
 'an',
 'an',
 'an',
 '17',
 'an',
 'an',
 'an',
 'an',
 '17',
 'an',
 'an',
 'an',
 'an',
 '24',
 'an',
 'an',
 'an',
 '35',
 '51 B53 B55',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '50',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 'an',
 '42',
 'an',
 '148',
 'an']